Revit 2024 API
VertexPositionNormalColored Members
The VertexPositionNormalColored type exposes the following members.
Constructors
Name | Description
VertexPositionNormalColored
 Constructs the vertex from a point, a normal vector, and a color.
Methods
Name | Description
Dispose |  (Inherited from Vertex.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetColor
 Gets the vertex's color.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSizeInFloats
 Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetColor
 Sets the vertex's color.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Vertex.)
Normal
 The vertex's normal vector.
Position
 The vertex's position.
See Also
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace